# TextRange Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextRange Class
Members See Also
---
An object that is used to identify a range of characters in a FormattedText.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class TextRange : IDisposable
```

Visual Basic
---
```text
Public Class TextRange _
	Implements IDisposable
```

Visual C++
---
```text
public ref class TextRange : IDisposable
```

# Remarks
A TextRange consists of a start, which is a zero-based index into the text, and a length, which is the number of characters in the range. The length can be zero.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TextRange
# See Also
TextRange Members
Autodesk.Revit.DB Namespace